mhavill/MRPMG-Docklands/ESP/3_Let's_chat/Code-PIO/ESP32 Server/src/server.cpp
/*******************************
 * Setup
 *******************************/
void setup(void)
{
  // Start the serial port
  Serial.begin(115200);
  delay(SECOND);
  pinMode(TRIGGER_PIN, INPUT_PULLUP);
  // Start the neopixel
  npsetup();

  WiFiManager wm;

  bool res;

  // wm.resetSettings();

  res = wm.autoConnect("AutoConnectAP", "password"); // password protected ap
  if (!res)
  {

    Serial.println("Failed to connect");

    ESP.restart();
  }

  // Start the WiFi
  // WiFi.mode(WIFI_STA);
  WiFi.hostname(device);
  strcpy((char *)ssid, WiFi.SSID().c_str());
  // WiFi.begin(ssid, password);
  Serial.println("");

  // Wait for connection
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(500);
    Serial.print(".");
  }
  Serial.println("");
  Serial.print("Connected to ");
  Serial.println(ssid);
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());

  if (MDNS.begin(device))
  {
    Serial.printf("MDNS responder started with name %s.local\n", device);
  }
  // Set up timers for display and web server
  timer.every(0.5 * SECOND, npblink);
  timer.in(speed, display_text);
  timer.in(1 * SECOND, updateVUmeter);
  timer.every(3 * SECOND, wmloop);
  timer.every(10, server_client_handler);
  timer.every(60, decayPeak);
  timer.every(30 * SECOND, updateEEPROM);

  /***********************************
   * Web Server Handlers
   * ******************************/
  server.on("/", HTTP_GET, []()
            {
  // Serve landing page
  server.send(200, "text/html", landing_page_html);
  Serial.println("Served Landing Page"); });

  server.on("/setmode", HTTP_POST, []()
            {
  String mode = server.arg("mode");
  
  if (mode == "text") 
  {
    display_mode = MODE_TEXT;
    server.send(200, "text/html", text_message_page_html);
    Serial.println("Served Text Message Page");
  } 
  else if (mode == "animations") 
  {
    // Start animations on display
    display_mode = MODE_ANIMATIONS;
    // Start going through GIFS
    gif.begin(LITTLE_ENDIAN_PIXELS);
    gifFile = root.openNextFile();
    server.send(200, "text/html", animations_page_html);
    Serial.println("Served Animations Page");
  } 
  else if (mode == "vumeter") 
  {
    display_mode = MODE_VUMETER;
    server.send(200, "text/html", vumeter_page_html);
    Serial.println("Served VU Meter Page"); 
  } 
  else if (mode == "stop") 
  {
    // Stop current mode
    display_mode = MODE_STOP;
    server.send(200, "text/html", landing_page_html);
    Serial.println("Served Landing Page after STOP");
  } 
  else 
  {
    server.send(400, "text/plain", "Invalid mode");
    Serial.println("Invalid mode received");
  } });

  server.on("/submit", HTTP_POST, MainPageSubmit);
  // server.on("/submit", HTTP_POST, []()

  server.on("/LEDupdate", LEDControl);

  server.onNotFound(handleNotFound);

  // VU Meter routes
  server.on("/vumeter", HTTP_GET, handleVUMeter);
  server.on("/vuupdate", HTTP_POST, handleVUMeterUpdate);

  /***************************
   * Start Web Server
   * ***************************/
  server.begin();
  Serial.println("HTTP server started");

  /***********************************
   * Initialize Display
   * ******************************/

  Serial.println("Starting MatrixPanel_I2S_DMA test...");
  // Custom pin mapping for all pins
  HUB75_I2S_CFG::i2s_pins _pins = {R1, G1, BL1, R2, G2, BL2, CH_A, CH_B, CH_C, CH_D, CH_E, LAT, OE, CLK};

  HUB75_I2S_CFG mxconfig(
      PANEL_WIDTH,  // width
      PANEL_HEIGHT, // height
      CHAIN_LENGTH, // chain length
      _pins         // pin mapping
  );

  mxconfig.i2sspeed = HUB75_I2S_CFG::HZ_20M;

  dma_display = new MatrixPanel_I2S_DMA(mxconfig);
  dma_display->begin();
  dma_display->setBrightness8(128); // 0-255
  dma_display->clearScreen();

  // Clear the layers
  gfx_layer_fg.clear();
  gfx_layer_fg.setTextWrap(false);

  gfx_layer_bg.clear();

  // set up initial messages & display mode
  display_mode = MODE_TEXT;
  lower_msg = ssid;
  upper_msg = " Melbourne Tech Guilds!  Please register now and enjoy the event. ";
  top_msg = "Welcome to";
  Serial.printf("lower_msg = %s, upper_msg = %s \n", lower_msg.c_str(), upper_msg.c_str());

  /*******************
   * Initialize LittleFS
   ******************/
  if (!LittleFS.begin(FORMAT_LITTLEFS_IF_FAILED))
  {
    Serial.println("LittleFS Mount Failed");
    return;
  }
  Serial.println("LittleFS Mounted Successfully");
}

/*******************************
 * Loop
 *******************************/

void loop(void)
{
  timer.tick();
  switch (display_mode)
  {
  case MODE_TEXT:
    // handled in display() timer
    timer.in(speed, display_text);
    break;
  case MODE_ANIMATIONS:
    timer.in(1 * SECOND, display_animations);

    break;
  case MODE_VUMETER:

    // handled in display() timer
    break;
  case MODE_STOP:
    // Do nothing
    break;
  }
}

/*******************************
 * Utility Functions
 *******************************/
bool updateVUmeter(void *)
{
  // Update VU meter display through Input FFT
  timer.in(20, updateVUmeter);
  if (pattern != 5)
    // TODO Replace FastLED
    // FastLED.clear();

    uint8_t divisor = 1; // If 8 bands, we need to divide things by 2
  if (numBands == 8)
    divisor = 2; // and average each pair of bands together

  for (int i = 0; i < 16; i += divisor)
  {
    uint8_t fftValue;

    if (numBands == 8)
      fftValue = (fftResult[i] + fftResult[i + 1]) / 2; // Average every two bands if numBands = 8
    else
      fftValue = fftResult[i];

    fftValue = ((prevFFTValue[i / divisor] * 3) + fftValue) / 4; // Dirty rolling average between frames to reduce flicker
    barHeights[i / divisor] = fftValue / (255 / M_HEIGHT);       // Scale bar height

    if (barHeights[i / divisor] > peak[i / divisor]) // Move peak up
      peak[i / divisor] = min(M_HEIGHT, (int)barHeights[i / divisor]);

