mhavill/MRPMG-Docklands/ESP/3_Let's_chat/Code-PIO/ESP32 Server/src/server.cpp
    prevFFTValue[i / divisor] = fftValue; // Save prevFFTValue for averaging later
  }

  // Draw the patterns
  for (int band = 0; band < numBands; band++)
  {
    drawPatterns(band);
  }

  // Decay peak
  // TODO set up timer
  // EVERY_N_MILLISECONDS(60)
  {
    for (uint8_t band = 0; band < numBands; band++)
      if (peak[band] > 0)
        peak[band] -= 1;
  }
  // TODO set up timer
  // EVERY_N_SECONDS(30)
  {
    // Save values in EEPROM. Will only be commited if values have changed.
    EEPROM.write(EEPROM_BRIGHTNESS, brightness);
    EEPROM.write(EEPROM_GAIN, gain);
    EEPROM.write(EEPROM_SQUELCH, squelch);
    EEPROM.write(EEPROM_PATTERN, pattern);
    EEPROM.write(EEPROM_DISPLAY_TIME, displayTime);
    EEPROM.commit();
  }
  // TODO set up timer
  // EVERY_N_SECONDS_I(timingObj, displayTime)
  {
    // timingObj.setPeriod(displayTime);
    if (autoChangePatterns)
      pattern = (pattern + 1) % 6;
  }
  // TODO Replace FastLED
  // FastLED.setBrightness(brightness);
  // FastLED.show();

  // ws.cleanupClients();

  return true;
}

bool decayPeak(void *)
{
  for (uint8_t band = 0; band < numBands; band++)
    if (peak[band] > 0)
      peak[band] -= 1;
  return true;
}
bool updateEEPROM(void *)
{
  // Save values in EEPROM. Will only be commited if values have changed.
  EEPROM.write(EEPROM_BRIGHTNESS, brightness);
  EEPROM.write(EEPROM_GAIN, gain);
  EEPROM.write(EEPROM_SQUELCH, squelch);
  EEPROM.write(EEPROM_PATTERN, pattern);
  EEPROM.write(EEPROM_DISPLAY_TIME, displayTime);
  EEPROM.commit();
  return true;
}

// Handle VU meter page GET request
void handleVUMeter()
{
  String html = FPSTR(vumeter_page_html); // Your VU meter HTML

  // Replace placeholders
  html.replace("%DISPLAYTIME%", String(displayTime));
  html.replace("%BRIGHTNESSVALUE%", String(brightness));
  html.replace("%GAINVALUE%", String(gain));
  html.replace("%SQUELCHVALUE%", String(squelch));

  server.send(200, "text/html", html);
}

// Handle VU meter control updates
void handleVUMeterUpdate()
{
  if (server.hasArg("cmd"))
  {
    String cmd = server.arg("cmd");
    char dataType = cmd.charAt(0);
    String dataValue = cmd.substring(1);

    switch (dataType)
    {
    case 't':
      displayTime = dataValue.toInt();
      Serial.printf("Display time: %d\n", displayTime);
      break;
    case 'b':
      brightness = dataValue.toInt();
      Serial.printf("Brightness: %d\n", brightness);
      break;
    case 'g':
      gain = dataValue.toInt();
      Serial.printf("Gain: %d\n", gain);
      break;
    case 's':
      squelch = dataValue.toInt();
      Serial.printf("Squelch: %d\n", squelch);
      break;
    case 'n':
      pattern = (pattern + 1) % 6;
      Serial.printf("Pattern: %d\n", pattern);
      break;
    case 'a':
      autoChangePatterns = !autoChangePatterns;
      Serial.printf("Auto patterns: %d\n", autoChangePatterns);
      break;
    }
  }

  // Send back current state as JSON
  String response = "{";
  response += "\"displayTime\":" + String(displayTime) + ",";
  response += "\"brightness\":" + String(brightness) + ",";
  response += "\"gain\":" + String(gain) + ",";
  response += "\"squelch\":" + String(squelch) + ",";
  response += "\"auto\":" + String(autoChangePatterns ? "true" : "false");
  response += "}";

  server.send(200, "application/json", response);
}

bool display_animations(void *)
{
  if (display_mode != MODE_ANIMATIONS)
    return true; // exit if mode changed
  server.handleClient();
  timer.in(100, display_animations);

  // Play all GIFs in the gifs directory
  root = FILESYSTEM.open(gifDir);
  if (root)
  {
    gifFile = root.openNextFile();
    while (gifFile)
    {
      if (!gifFile.isDirectory()) // play it
      {
        // C-strings... urghh...
        memset(filePath, 0x0, sizeof(filePath));
        strcpy(filePath, gifFile.path());

        // Show it.
        ShowGIF(filePath);
      }
      gifFile.close();
      server.handleClient();
      if (display_mode != MODE_ANIMATIONS)
        return true; // exit if mode changed
      gifFile = root.openNextFile();
    }
    root.close();
  } // root
  return true;
}

bool server_client_handler(void *)
{
  server.handleClient();
  return true;
}

bool wmloop(void *)
{
  // is configuration portal requested?
  if (digitalRead(TRIGGER_PIN) == LOW)
  {
    WiFiManager wm;

    // reset settings - for testing
    wm.resetSettings();

    ESP.restart();
  }
  return true;
}

String urlDecode(String input)
{
  String decoded = "";
  char a, b;
  unsigned int len = input.length();

  for (unsigned int i = 0; i < len; i++)
  {
    char c = input[i];

    if (c == '+')
    {
      decoded += ' ';
    }
    else if (c == '%')
    {
      if (i + 2 < len)
      {
        a = input[i + 1];
        b = input[i + 2];

        // Convert hex digits to decimal
        if (a >= '0' && a <= '9')
          a = a - '0';
        else if (a >= 'a' && a <= 'f')
          a = a - 'a' + 10;
        else if (a >= 'A' && a <= 'F')
          a = a - 'A' + 10;

        if (b >= '0' && b <= '9')
          b = b - '0';
        else if (b >= 'a' && b <= 'f')
          b = b - 'a' + 10;
        else if (b >= 'A' && b <= 'F')
          b = b - 'B' + 10;

        decoded += char(16 * a + b);
        i += 2;
      }
      else
      {
        decoded += '%';
      }
    }
    else
    {
      decoded += c;
    }
  }

  // Serial.println("=== Decode Complete ===");

  return decoded;
}

bool display_text(void *)
{
  timer.in(speed, display_text); // re-schedule next display update
  updateBackground();
  scrollText(wheelval, upper_msg.c_str());                   // Prints Scrolling text with a rainbow color
  printTextRainbowCentered(wheelval, lower_msg.c_str(), 25); // Prints text X-Centered to chosen Y position with rainbow color
  printTextRainbowCentered(wheelval, top_msg.c_str(), 0);    // Prints text X-Centered to chosen Y position with rainbow color
  // printTextRainbowCentered(wheelval, lower_msg.c_str(), 24);  //Prints text X-Centered to chosen Y position with rainbow color
  // scrollText(wheelval, lower_msg.c_str());  //Prints text X-Centered to chosen Y position with rainbow color

  // gfx_layer_fg.display();
  // gfx_layer_bg.display();

  gfx_compositor.Blend(gfx_layer_bg, gfx_layer_fg); // blend and immediately display

  wheelval += 1;
  // update timer interval in case it changed
  timer.in(100 / speed, display_text);
  return true;
}

void handleNotFound()
{

  String message = "File Not Found\n\n";
  message += "URI: ";
  message += server.uri();
  message += "\nMethod: ";
  message += (server.method() == HTTP_GET) ? "GET" : "POST";
  message += "\nArguments: ";
  message += server.args();
  message += "\n";
  for (uint8_t i = 0; i < server.args(); i++)
  {
    message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
  }
  server.send(404, "text/plain", message);
  Serial.println(message);
}
// void MainPage()
// {
//   String _html_page = html_page;             /*Read The HTML Page*/
//   server.send(200, "text/html", _html_page); /*Send the code to the web server*/
// }

void MainPageSubmit()
{

  String upperText = server.arg("upperText");
  String lowerText = server.arg("lowerText");
  String topText = server.arg("topText");

  speed = server.arg("speed").toInt() * 10;
  background = server.arg("background").toInt();

  // Decode the URL-encoded strings
  String upperText2 = urlDecode(upperText);
  String lowerText2 = urlDecode(lowerText);
  String topText2 = urlDecode(topText);

  Serial.println(" ***************************");
  Serial.print("Received upperText: ");
  Serial.println(upperText2);
  Serial.print("Received lowerText: ");
  Serial.println(lowerText2);

  Serial.print("Received topText: ");
  Serial.println(topText2);
  Serial.print("Received speed: ");
  Serial.println(speed);
  Serial.print("Received background: ");
  Serial.println(background);

  server.send(200, "text/plain", "Messages received!");

  // Clear first, then assign with explicit std::string construction
  upper_msg.clear();
  lower_msg.clear();
  top_msg.clear();

